<template>
  <div class="suffer">
    <div>
      <ul>
        <li>
          <h4>项目经验1</h4>
          <p>
            <span>项目名称:</span>NEWEL新象地板·木门官网
          </p>
          <p>
            <span>项目简介：</span>
          </p>
          <p>Newel新象是集地板、木门和墙纸系列装饰材料的技术研发、市场营销、售后服务为一体的专业公司,先后投资3.5亿元,在成都南丰国际工业园建成占地60000的现代化生产基地。</p>
          <p>
            <span>技术栈：</span>vue.js + vue-router + vueX + element-ui + vue-cli；
          </p>
          <p>
            <span>责任描述：</span>
          </p>
         <p>1.负责UI效果图的网页制作；</p>
         <p>2.使用vue全家桶对网页进行搭建快速高效完成页面（h5+响应式）；</p>
         <p>3. 使用 element-ui完成移动端页面的搭建；</p>
         <p>4.与后端开发人员配合完成产品的调试，接口的调用等； </p>
        </li>
        <li>
            <h4>项目经验2</h4>
          <p>
            <span>项目名称:</span>一起下围棋app
          </p>
          <p>
            <span>项目简介：</span>
          </p>
          <p>一起学围棋app是一款为围棋爱好者开发的软件，软件现在有关于新手小白的学习了，并且学习基础知识后会获得奖励的喵咪衣服鞋子可以为自己的喵咪装扮哦，一款集围棋与装扮于一体的app。</p>
          <p>
            <span>技术栈：</span>5+App、Native.js、jQuery
          </p>
          <p>
            <span>责任描述：</span>
          </p>
         <p>1.	使用5+App，实现UI效果图；</p>
         <p>2.	使用jQuery实现围棋规则；</p>
         <p>3.	通过Native.js调用需要的ios和android的原生API</p>
         <p>4.	与后端开发人员配合完成产品的调试，接口的调用等。</p>
        </li>
        <li>  <h4>项目经验3</h4>
          <p>
            <span>项目名称:</span>秀山大华百货小程序
          </p>
          <p>
            <span>项目简介：</span>
          </p>
          <p>重庆市秀山县大华百货有限公司以经销批发的经营模式主营服装、鞋、包、 化妆品、饰品。公司拥有专业的技术和销售团队，员工人数501 - 1000 人，实力雄厚注册资本，秀山大华百货在未来社交商业模式探索之路上，离不开小程序的助力。</p>
          <p>
            <span>技术栈：</span>uni-app、vue.js、vue-router、Mint UI
          </p>
          <p>
            <span>责任描述：</span>
          </p>
         <p>1.	该小程序分为首页、用户管理、购物车管理、订单管理、退出5个模块；</p>
         <p>2.	分别在首页模块实现了模糊分页查询、分类分页查询等功能；</p>
         <p>3.	用户管理模块实现了登录、注册、修改、查看信息等功能；</p>
         <p>4.	购物车模块实现了查看、购买、修改商品数量等功能；</p>
         <p>5.	订单模块实现了查看、删除等功能。</p>
         </li>
        <li>  <h4>项目经验4</h4>
          <p>
            <span>项目名称:</span>新希望六和食品控股有限公司官网
          </p>
          <p>
            <span>项目简介：</span>
          </p>
          <p>新希望六和食品控股有限公司旗下有美好食品、千喜鹤、石门一味等品牌。公司遵循刘永好董事长将企业“做好、做强、做大”的指示，坚持以质量为中心的品牌发展战略，狠抓产品质量，坚持科技创新，强化营销工作，争创名牌产品，企业持续地保持了高速增长的势头，取得了显著的经济和社会效益公司一直坚持规范运作、推进科学管理，不断完善法人治理结构，创建了独具特色的企业文化，锻造了优秀的员工队伍，为持续发展奠定了良好的基础。</p>
          <p>
            <span>技术栈：</span>HTML5、CSS3、Ajax、JQuery、Bootstrap、swiper
          </p>
          <p>
            <span>责任描述：</span>
          </p>
         <p>1.	CSS+DIV搭建，采用jQuery实现特效和页面优化及代码维护;</p>
         <p>2.	运用html5进行页面布局，CSS3设页面样式，兼容各大主流浏览器；</p>
         <p>3.	使用Bootstrap框架实现其响应式网站效果，兼容所有浏览器且适应所有移动端;</p>
         <p>4.	运用H5图片，轮播插件swiper来实现页面的轮播图特效；</p>
         <p>5.	使用ajax与后台进行交互。</p>
         </li>
      </ul>
    </div>
  </div>
</template>
<style>
    .suffer {
        margin: 0 auto;
        width: 90%;
        text-align: left;
    }
    .suffer li{
        list-style: none;
        padding: 1rem 0;
    }
    .suffer p {
        padding: .25rem 0;
        font-size: 80%;
    }
    .suffer span {
        font-size: 1rem;
    }
</style>